Documents/ЛБ_УстановитьШаблонПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановитьШаблонПриказа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_УстановкаОтменаШаблонаПриказа</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ТекущийШаблонПриказаВставки</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ТекущийШаблонПриказаМеталлыНастройкаОтклонений</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ТекущийШаблонПриказаПроцентныеСтавкиАкция</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ТекущийШаблонПриказаПроцентныеСтавки</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ТекущийШаблонПриказаМеталлы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийУстановитьШаблонПриказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаБезНулей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтавкиПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗалогодателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДиапазонСумм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНачалаПрименения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Металлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Металл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияОбъектаЗалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вставка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОгранки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОгранки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КачествоОгранки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КачествоОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесоваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ВесовыеГруппыДрагоценныхКамней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазовыеНастройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Металл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяПроба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ГруппыПроб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонениеОтБазовойПоУмолчанию</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОкругления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьВБольшуюСторону</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЦенаПоЗапросу</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОценкаПоБазовойКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияОбъектаЗалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Металл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ГруппыПроб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОклонениеОтБазовой</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОтклонения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОкругления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьВБольшуюСторону</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаОтклоненийОтБазовыхЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияОбъектаЗалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Металл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ГруппыПроб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонениеОтБазовойЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОтклонения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтавкиПроцентовАкция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗалогодателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДиапазонСумм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийУстановитьШаблонПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийУстановитьШаблонПриказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроцентныеСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Металлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентныеСтавкиАкция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_СхемыКредитования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_СхемыКредитования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезПродленияДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПримененияГибкогоПроцента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПрименятьАкции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказОтВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПричиныПримененияПроцентнойСхемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗалоговогоБилета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЛБ_УстановитьШаблонПриказа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;   
	Если УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
		ЭтоСуперпользователь = Истина;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки;    
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	ЗаполнитьСписокЛомбардов();
	УстановитьВидимостьПоВидуОперации();  
	УстановитьСостояниеДокумента(); 
	
	Если Объект.Проведен Тогда  
		ЭтаФорма.ТолькоПросмотр = Истина;  
		Элементы.СписокЛомбардов.ТолькоПросмотр = Истина;
		Элементы.СтавкиПроцентов.КоманднаяПанель.Доступность = Ложь; 
		Элементы.Металлы.КоманднаяПанель.Доступность = Ложь; 
		Элементы.БазовыеНастройки.КоманднаяПанель.Доступность = Ложь;
        Элементы.ОценкаПоБазовойКатегории.КоманднаяПанель.Доступность = Ложь;
		Элементы.НастройкаОтклоненийОтБазовыхЦен.КоманднаяПанель.Доступность = Ложь;
		Элементы.Вставки.КоманднаяПанель.Доступность = Ложь;
		Элементы.СтавкиПроцентовАкция.КоманднаяПанель.Доступность =ложь;
	КонецЕсли;	

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//+МАН 18.03.26 Убрал. Заявка 3654
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//-МАН

	//+МАН 17.03.26 Изменение заголовка формы. Заявка 3654.
	УстановитьЗаголовокФормы();
	//-МАН
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьВидимостьПоВидуОперации()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки Тогда 
		Элементы.СтраницаМеталлы.Видимость = Ложь;
		Элементы.СтраницаВставки.Видимость = Ложь;
		Элементы.СтраницаСтавкиПроцентов.Видимость = Истина; 
		Элементы.СтраницаСтавкиПроцентовАкция.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Металлы Тогда 
		Элементы.СтраницаМеталлы.Видимость = Истина;
		Элементы.СтраницаВставки.Видимость = Ложь;
		Элементы.СтраницаСтавкиПроцентов.Видимость = Ложь; 
		Элементы.СтраницаСтавкиПроцентовАкция.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Вставки Тогда
		Элементы.СтраницаМеталлы.Видимость = Ложь;
		Элементы.СтраницаВставки.Видимость = Истина;
		Элементы.СтраницаСтавкиПроцентов.Видимость = Ложь;
		Элементы.СтраницаСтавкиПроцентовАкция.Видимость = Ложь; 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавкиАкция Тогда
		Элементы.СтраницаМеталлы.Видимость = Ложь;
		Элементы.СтраницаВставки.Видимость = Ложь;
		Элементы.СтраницаСтавкиПроцентов.Видимость = Ложь;
		Элементы.СтраницаСтавкиПроцентовАкция.Видимость = Истина;	
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры          


&НаСервере
Процедура ОчиститьРеквизитыПоВидуОперации()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки Тогда
		Объект.Акция = Справочники.ЛБ_Акции.ПустаяСсылка();
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Металлы Тогда 
		Объект.Акция = Справочники.ЛБ_Акции.ПустаяСсылка();
		Объект.СхемаКредитования = Справочники.ЛБ_СхемыКредитования.ПустаяСсылка();
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Вставки Тогда
		Объект.Акция = Справочники.ЛБ_Акции.ПустаяСсылка(); 
		Объект.СхемаКредитования = Справочники.ЛБ_СхемыКредитования.ПустаяСсылка();
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавкиАкция Тогда
		Объект.СхемаКредитования = Справочники.ЛБ_СхемыКредитования.ПустаяСсылка();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимостьПоВидуОперации();
	ОчиститьРеквизитыПоВидуОперации();
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХранилища() 
	Возврат ПоместитьВоВременноеХранилище(Объект.СтавкиПроцентов.Выгрузить(), УникальныйИдентификатор);
КонецФункции	

&НаКлиенте
Процедура ПомощникЗаполненияПроцентныхСтавок(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.СхемаКредитования) Тогда
		Сообщить("Не выбрана схема кредитования!");
		Возврат;
	КонецЕсли;	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораСтавок",ЭтаФорма);  
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКредитования", Объект.СхемаКредитования);
	ПараметрыФормы.Вставить("АдресХранилища", ПолучитьАдресХранилища());
	ОткрытьФорму("Обработка.ЛБ_ПомощникЗаполненияПроцентныхСтавок.Форма", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСтавок(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Объект.СтавкиПроцентов.Очистить();
	Для каждого Стр1 Из Результат.СтатусыКлиентов Цикл   
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Стр1.Статус); 
		Для каждого Стр2 Из Результат.ДниНачалаПрименения.НайтиСтроки(Отбор) Цикл 
			Для каждого Стр3 Из Результат.ДиапазоныСумм.НайтиСтроки(Отбор) Цикл 
				НоваяСтр = Объект.СтавкиПроцентов.Добавить(); 
			    НоваяСтр.СтатусЗалогодателя = Стр1.Статус;
				НоваяСтр.ПричинаПрименения = Стр2.ПричинаПрименения; 
				НоваяСтр.ДеньНачалаПрименения = Стр2.ДеньНачалаПрименения;
				НоваяСтр.ДиапазонСумм = Стр3.ДиапазонСумм;
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", Объект.Дата);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	СписокЛомбардов = Результат;
	Объект.СтрокаЛомбарды = Результат;
КонецПроцедуры	
 
&НаСервере
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьПроцентныеСтавки(Команда)
	Объект.СтавкиПроцентов.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СписокЛомбардовОчистка(Элемент, СтандартнаяОбработка)
	Объект.Ломбарды.Очистить();
	СписокЛомбардов = "";
	Объект.СтрокаЛомбарды = "";
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьПоМеталлу(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораМеталла",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_ДрагоценныеМеталлы.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораМеталла(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = новый Структура;
	Отбор.Вставить("Металл", Результат);
	СтрокиМ = Объект.Металлы.НайтиСтроки(Отбор); 
	Для каждого стрМ Из СтрокиМ Цикл
		Объект.Металлы.Удалить(СтрМ);
	Конеццикла;
	
	Запрос  = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Результат);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Пробы.Ссылка КАК Проба
	               |ИЗ
	               |	Справочник.ЛБ_Пробы КАК ЛБ_Пробы
	               |ГДЕ
	               |	ЛБ_Пробы.Владелец = &Владелец
	               |	И ЛБ_Пробы.ПометкаУдаления = ЛОЖЬ";
	ТаблицаПроб = Запрос.Выполнить().Выгрузить();
	
	ВыборкаСпр = Справочники.ЛБ_КатегорииОбъектовЗалога.Выбрать();
	Пока ВыборкаСпр.Следующий() Цикл
		Если ВыборкаСпр.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;	    
		Отбор = Новый Структура;
		Отбор.Вставить("КатегорияОбъектаЗалога", ВыборкаСпр.Ссылка);
		Для каждого стр Из ТаблицаПроб Цикл 
			Отбор.Вставить("Проба", Стр.Проба);  
			СтрокиМ = Объект.Металлы.НайтиСтроки(Отбор);
			Если СтрокиМ.Количество() = 0 Тогда
				НоваяСтр = Объект.Металлы.Добавить();
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.Металл = Стр.Проба.Владелец;
			    НоваяСтр.КатегорияОбъектаЗалога = ВыборкаСпр.Ссылка;  
			КонецЕсли;	
		Конеццикла;	
	КонецЦикла;	
	Объект.Металлы.Сортировать("Металл, Проба, КатегорияОбъектаЗалога");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьМеталлы(Команда)
	Объект.Металлы.Очистить();
КонецПроцедуры

&НаСервере
Функция ПолучитьВыбранныеМеталлы()   
	ТаблицаМеталлов = Объект.Металлы.Выгрузить(, "Металл");   
	ТаблицаМеталлов.Свернуть("Металл");
	
	МассивМ = Новый Массив;
	Для каждого Стр Из ТаблицаМеталлов Цикл  
		МассивМ.Добавить(Стр.Металл);
	КонецЦикла;	                      
	Возврат МассивМ;
КонецФункции	

&НаКлиенте
Процедура СтраницыМПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "СтраницаМ2" Тогда
		Элементы.БазовыеНастройкиМеталл.СписокВыбора.ЗагрузитьЗначения(ПолучитьВыбранныеМеталлы()); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура БазовыеНастройкиБазоваяПробаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Текстрока = Элементы.БазовыеНастройки.ТекущиеДанные;
	ПараметрыОтбора = новый Структура("Металл", Текстрока.Металл);
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);   
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораГруппыМеталла",ЭтаФорма);
	ОткрытьФорму("Справочник.ЛБ_ГруппыПроб.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораГруппыМеталла(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	Текстрока = Элементы.БазовыеНастройки.ТекущиеДанные;
    Текстрока.БазоваяПроба = Результат;
КонецПроцедуры	

&НаСервере
Функция ПолучитьКлючСтроки()
	Возврат ЛБ_ОбщийМодуль.ПолучитьКлючСтроки(Объект, "БазовыеНастройки");
КонецФункции	

&НаКлиенте
Процедура БазовыеНастройкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧасти = Элементы.БазовыеНастройки.ТекущиеДанные;
		СтрокаТабличнойЧасти.КлючСтроки = ПолучитьКлючСтроки(); 
	КонецЕсли;	
КонецПроцедуры      

&НаКлиенте
Процедура БазовыеНастройкиБазоваяЦенаПоЗапросуПриИзменении(Элемент)
	ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
	Если ТекСтрока.БазоваяЦенаПоЗапросу Тогда
		ТекСтрока.БазоваяЦена = 0;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура БазовыеНастройкиПриАктивизацииСтроки(Элемент)
	СтрокаТабличнойЧасти = Элементы.БазовыеНастройки.ТекущиеДанные;	
	
	Если СтрокаТабличнойЧасти <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧасти.КлючСтроки);
		Элементы.ОценкаПоБазовойКатегории.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);		
		Элементы.НастройкаОтклоненийОтБазовыхЦен.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.ОценкаПоБазовойКатегории.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		Элементы.НастройкаОтклоненийОтБазовыхЦен.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БазовыеНастройкиПередУдалением(Элемент, Отказ)
	СтрокаТабличнойЧастиНастройки = Элементы.БазовыеНастройки.ТекущиеДанные;
	
	Если СтрокаТабличнойЧастиНастройки <> Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧастиНастройки.КлючСтроки);
		
		НайденныеСтроки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор);
		
		Для каждого Строка Из НайденныеСтроки Цикл
			Объект.ОценкаПоБазовойКатегории.Удалить(Строка);	
		КонецЦикла; 
		
		НайденныеСтроки = Объект.НастройкаОтклоненийОтБазовыхЦен.НайтиСтроки(Отбор);
		
		Для каждого Строка Из НайденныеСтроки Цикл
			Объект.НастройкаОтклоненийОтБазовыхЦен.Удалить(Строка);	
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьПробыПоБазовой(Идентификатор) 
	СтрокаТабличнойЧастиНастройки = Объект.БазовыеНастройки.НайтиПоИдентификатору(Идентификатор);
	Если СтрокаТабличнойЧастиНастройки = неопределено Тогда
		Возврат;
	КонецЕсли;
	ЕстьОшибкиЗаполнения = ложь;
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.Металл) Тогда
		Сообщить("Строка № " + Строка(СтрокаТабличнойЧастиНастройки.НомерСтроки) + ": Не выбран металл!");
		ЕстьОшибкиЗаполнения = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.БазоваяКатегория) Тогда
		Сообщить("Строка № " + Строка(СтрокаТабличнойЧастиНастройки.НомерСтроки) + ": Не определена базовая категория объектов залога!");
		ЕстьОшибкиЗаполнения = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.БазоваяПроба) Тогда
		Сообщить("Строка № " + Строка(СтрокаТабличнойЧастиНастройки.НомерСтроки) + ":Не определена базовая проба (группа проб)!");
		ЕстьОшибкиЗаполнения = Истина;
	КонецЕсли;	 
	Если ЕстьОшибкиЗаполнения Тогда
		Возврат;
	КонецЕсли;	   
	
	ОтборК = Новый Структура;
	ОтборК.Вставить("КлючСтроки", СтрокаТабличнойЧастиНастройки.КлючСтроки);
	СтрокиК = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(ОтборК);
	Для каждого стрК из СтрокиК Цикл 
		Объект.ОценкаПоБазовойКатегории.Удалить(СтрК);
	КонецЦикла;	   
	
	СписокПроб = Новый СписокЗначений;
	СписокКатегорий = Новый СписокЗначений;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Металл", СтрокаТабличнойЧастиНастройки.Металл);
	СтрокиМ = Объект.Металлы.НайтиСтроки(Отбор);
	Для каждого СтрМ из СтрокиМ Цикл   
		ГруппаП = ЛБ_ОбщийМодуль.ПолучитьГруппуПроб(СтрМ.Проба);
		Если СписокПроб.НайтиПоЗначению(ГруппаП) = неопределено Тогда
			СписокПроб.Добавить(ГруппаП);
		КонецЕсли;	
		Если СписокКатегорий.НайтиПоЗначению(СтрМ.КатегорияОбъектаЗалога) = неопределено Тогда
			СписокКатегорий.Добавить(СтрМ.КатегорияОбъектаЗалога);
		КонецЕсли;	
	Конеццикла;	
	
	Для каждого Проба Из СписокПроб Цикл
		Для каждого Категория Из СписокКатегорий Цикл 
			 Если Проба.Значение = СтрокаТабличнойЧастиНастройки.БазоваяПроба И
				  Категория.Значение = СтрокаТабличнойЧастиНастройки.БазоваяКатегория Тогда
				 Продолжить;
			 КонецЕсли; 
			 
			 ЕстьЗаписьМеталлы = ложь;
			 ОтборМ = Новый Структура;
			 ОтборМ.Вставить("Металл", СтрокаТабличнойЧастиНастройки.Металл);
			 ОтборМ.Вставить("КатегорияОбъектаЗалога", Категория.Значение);  
			 Для каждого СтрП Из Проба.Значение.Пробы Цикл
				 ОтборМ.Вставить("Проба", СтрП.Проба); 
				 СтрокиМ = Объект.Металлы.НайтиСтроки(ОтборМ);
				 Если СтрокиМ.Количество() = 0 Тогда
					Продолжить; 
				 Иначе   
					ЕстьЗаписьМеталлы = Истина;
					Прервать;
				 КонецЕсли;	 
			 КонецЦикла;	
			 Если НЕ ЕстьЗаписьМеталлы Тогда
				Продолжить;
			 КонецЕсли;	
			 
			 НоваяСтр = Объект.ОценкаПоБазовойКатегории.Добавить();
			 НоваяСтр.КлючСтроки = СтрокаТабличнойЧастиНастройки.КлючСтроки;
			 НоваяСтр.КатегорияОбъектаЗалога = Категория.Значение;
			 НоваяСтр.Металл = СтрокаТабличнойЧастиНастройки.Металл;
			 НоваяСтр.Проба = Проба.Значение; 
			 НоваяСтр.ОклонениеОтБазовой = СтрокаТабличнойЧастиНастройки.ОтклонениеОтБазовойПоУмолчанию;
			 НоваяСтр.ПорядокОкругления = СтрокаТабличнойЧастиНастройки.ПорядокОкругления;
			 НоваяСтр.ОкруглятьВБольшуюСторону = СтрокаТабличнойЧастиНастройки.ОкруглятьВБольшуюСторону;
		 Конеццикла;	 
	 КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаЗаполнитьПоБазовой(Команда) 
	СтрокаТабличнойЧастиНастройки = Элементы.БазовыеНастройки.ТекущиеДанные;
	Если СтрокаТабличнойЧастиНастройки = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.Металл) ИЛИ 
		   НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.БазоваяПроба) ИЛИ
		     НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.БазоваяКатегория) Тогда
		Сообщить("Перед заполнением в верхней таблице должны быть выбраны металл, базовая проба и базовая категория!", СтатусСообщения.Информация);	 
	КонецЕсли;	

	ЗаполнитьПробыПоБазовой(СтрокаТабличнойЧастиНастройки.ПолучитьИдентификатор()); 
		
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиНастройки.КлючСтроки);
	Элементы.ОценкаПоБазовойКатегории.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПроб(Металл) 
	Отбор= Новый Структура;
	Отбор.Вставить("Металл", Металл);
	Строки = Объект.Металлы.НайтиСтроки(Отбор); 
	СписокМ = Новый СписокЗначений;
	Для каждого Стр Из Строки Цикл 
		СписокМ.Добавить(Стр.Проба);
	КонецЦикла;
	Возврат СписокМ;
КонецФункции 

&НаСервере
Функция ПолучитьСписокКатегорий(Металл) 
	Отбор= Новый Структура;
	Отбор.Вставить("Металл",Металл);
	Строки = Объект.Металлы.НайтиСтроки(Отбор); 
	СписокК = Новый СписокЗначений;
	Для каждого Стр Из Строки Цикл 
		СписокК.Добавить(Стр.КатегорияОбъектаЗалога);
	КонецЦикла;	 
	Возврат СписокК;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЗначениеОтклоненияМеталлы(Команда) 
	ТекСтрокаНастройки = Элементы.БазовыеНастройки.ТекущиеДанные;  
	Если ТекСтрокаНастройки = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("Вид", 0);  
	Если НЕ Элементы.БазовыеНастройки.ТекущиеДанные = неопределено Тогда
	    ПараметрыФормы.Вставить("Металл", ТекСтрокаНастройки.Металл);  
		ПараметрыФормы.Вставить("ВидОтклонения", ТекСтрокаНастройки.ОтклонениеОтБазовойПоУмолчанию);  
		ПараметрыФормы.Вставить("СписокП", ПолучитьСписокПроб(ТекСтрокаНастройки.Металл));
		ПараметрыФормы.Вставить("СписокК", ПолучитьСписокКатегорий(ТекСтрокаНастройки.Металл));
	КонецЕсли;   
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОтклонения", ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_УстановитьШаблонПриказа.Форма.ФормаЗаполненияОтклонения", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьПоНастройкамНаСервере(ИдентификаторСтроки, ИдентификаторСтрокиОтбор) 
	СтрокаБазовая = Объект.БазовыеНастройки.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаН = ТаблицаОтборовМеталл.НайтиПоИдентификатору(ИдентификаторСтрокиОтбор);
	
	ОтборБ = Новый Структура;
    ОтборБ.Вставить("Металл", СтрокаН.Металл);
	ОтборБ.Вставить("Проба", СтрокаН.Проба);
    ОтборБ.Вставить("КатегорияОбъектаЗалога", СтрокаН.Категория);
	
	СтрокиБ = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(ОтборБ);
	Если СтрокиБ.Количество() = 0 Тогда 
		НоваяСтр = Объект.ОценкаПоБазовойКатегории.Добавить(); 
		НоваяСтр.КлючСтроки = СтрокаБазовая.КлючСтроки;
		НоваяСтр.Металл = СтрокаБазовая.Металл;
		НоваяСтр.Проба = ОтборБ.Проба; 
		НоваяСтр.КатегорияОбъектаЗалога = ОтборБ.КатегорияОбъектаЗалога;
		НоваяСтр.ЗначениеОтклонения = СтрокаН.Отклонение;
		НоваяСтр.ОклонениеОтБазовой = СтрокаН.ВидОтклонения;  
		НоваяСтр.ПорядокОкругления = СтрокаБазовая.ПорядокОкругления; 
		НоваяСтр.ОкруглятьВБольшуюСторону = СтрокаБазовая.ОкруглятьВБольшуюСторону; 
	Иначе	  
		Стр = СтрокиБ.Получить(0);
		Стр.ЗначениеОтклонения = СтрокаН.Отклонение;
		Стр.ОклонениеОтБазовой = СтрокаН.ВидОтклонения;  
	КонецЕсли;
КонецПроцедуры  

&НаСервере 
Процедура ЗаполнитьТаблицуОтборовМ(Результат)  
	ТаблицаОтборовМеталл.Очистить(); 
	Для каждого Проба Из Результат.Проба Цикл 
		Для каждого Категория из Результат.Категория Цикл 
			ЕстьЗаписьМеталлы = ложь;
			ОтборМ = Новый Структура;
			ОтборМ.Вставить("Металл", Результат.Металл);
			ОтборМ.Вставить("КатегорияОбъектаЗалога", Категория.Значение);  
			Для каждого СтрП Из Проба.Значение.Пробы Цикл
				ОтборМ.Вставить("Проба", СтрП.Проба); 
				СтрокиМ = Объект.Металлы.НайтиСтроки(ОтборМ);
				Если СтрокиМ.Количество() = 0 Тогда
					Продолжить; 
				Иначе   
					ЕстьЗаписьМеталлы = Истина;
					Прервать;
				КонецЕсли;	 
			КонецЦикла;	
			Если НЕ ЕстьЗаписьМеталлы Тогда
				Продолжить;
			КонецЕсли;	
			НоваяСтр = ТаблицаОтборовМеталл.Добавить();
			НоваяСтр.ВидОтклонения = Результат.ВидОтклонения;
	        НоваяСтр.Отклонение = Результат.Отклонение;
			НоваяСтр.Металл = Результат.Металл;
			НоваяСтр.Проба = Проба.Значение;
			НоваяСтр.Категория = Категория.Значение;
	    КонецЦикла;
	КонецЦикла; 
	
	//Если ТаблицаОтборовМеталл.Количество() = 0  Тогда   
	//	Для каждого Категория из Результат.Категория Цикл 
	//		НоваяСтр = ТаблицаОтборовМеталл.Добавить(); 
	//		НоваяСтр.ВидОтклонения = Результат.ВидОтклонения;
	//	    НоваяСтр.Отклонение = Результат.Отклонение;
	//		НоваяСтр.Металл = Результат.Металл; 
	//		НоваяСтр.Категория = Категория.Значение;
	//    КонецЦикла;
	//КонецЕсли;
	//Если ТаблицаОтборовМеталл.Количество() = 0 Тогда 
	//	НоваяСтр = ТаблицаОтборовМеталл.Добавить();
	//	НоваяСтр.ВидОтклонения = Результат.ВидОтклонения;
	//	НоваяСтр.Отклонение = Результат.Отклонение;
	//	НоваяСтр.Металл = Результат.Металл;
	//КонецЕсли;	
КонецПроцедуры 	

&НаКлиенте
Процедура ПослеВыбораОтклонения(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	ЗаполнитьТаблицуОтборовМ(Результат);
	
	ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
	Для каждого СтрМ Из ТаблицаОтборовМеталл Цикл
		
		Отбор = Новый Структура; 
	    Отбор.Вставить("Металл", СтрМ.Металл);
	    Отбор.Вставить("Проба", СтрМ.Проба);
	    Отбор.Вставить("КатегорияОбъектаЗалога", СтрМ.Категория);
	 
	    Строки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			//ЗаполнитьПоНастройкамНаСервере(ТекСтрока.ПолучитьИдентификатор(), СтрМ.ПолучитьИдентификатор());
			Если НЕ (СтрМ.Проба = ТекСтрока.БазоваяПроба И СтрМ.Категория = ТекСтрока.БазоваяКатегория) Тогда
				НоваяСтр = Объект.ОценкаПоБазовойКатегории.Добавить();
				НоваяСтр.Ключстроки = ТекСтрока.КлючСтроки;
				НоваяСтр.Металл = СтрМ.Металл;
				НоваяСтр.Проба = СтрМ.Проба;
				НоваяСтр.КатегорияОбъектаЗалога = СтрМ.Категория;
	            НоваяСтр.ЗначениеОтклонения = СтрМ.Отклонение;	
				НоваяСтр.ОклонениеОтБазовой = СтрМ.ВидОтклонения; 
				НоваяСтр.ПорядокОкругления = ТекСтрока.ПорядокОкругления; 
				НоваяСтр.ОкруглятьВБольшуюСторону = ТекСтрока.ОкруглятьВБольшуюСторону;
			КонецЕсли;	
	    Иначе
		   Для каждого Стр Из Строки Цикл	
			   Стр.ЗначениеОтклонения = СтрМ.Отклонение;	
			   Стр.ОклонениеОтБазовой = СтрМ.ВидОтклонения; 
		   КонецЦикла;	
	    КонецЕсли;  
	Конеццикла;  
	Объект.ОценкаПоБазовойКатегории.Сортировать("Металл, Проба, КатегорияОбъектаЗалога");  
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", ТекСтрока.КлючСтроки);
	Элементы.ОценкаПоБазовойКатегории.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);		
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтклоненияОсн(Команда)
	Объект.ОценкаПоБазовойКатегории.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура БазовыеНастройкиМеталлПриИзменении(Элемент)
	ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
	Отбор = новый структура;
	Отбор.Вставить("Металл", ТекСтрока.Металл);
	Строки = Объект.БазовыеНастройки.НайтиСтроки(Отбор);
	Если Строки.количество() > 1 Тогда 
		Сообщить("Металл " + СокрЛП(ТекСтрока.Металл) + " уже выбран в табличной части!", Статуссообщения.Внимание); 
		ТекСтрока.Металл = ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеМеталлы.ПустаяСсылка");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура БазовыеНастройкиОтклонениеОтБазовойПоУмолчаниюПриИзменении(Элемент)
	//+МАН 11.03.25 Добавил проверку и условие. Заявка 3654
	Отбор = Новый Структура;
	Отбор.Вставить("Металл", ТекущийЭлемент.ТекущиеДанные.Металл);
	
	НайденныеСтроки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОтклонение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Заполнить отклонение от базовой цены в нижней таблице выбранным значением?",  РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да, );
	КонецЕсли;
	//-МАН
КонецПроцедуры  

&НаКлиенте
Процедура ПослеОтветаНаВопросОтклонение(Результат, Параметры) Экспорт  
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
		НовоеОтклонение = ТекСтрока.ОтклонениеОтБазовойПоУмолчанию;
		КлючСтроки = ТекСтрока.КлючСтроки;
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", КлючСтроки);
		Строки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор); 
		
		Для каждого Стр Из строки Цикл 
			Стр.ОклонениеОтБазовой = НовоеОтклонение;
		Конеццикла;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура БазовыеНастройкиПорядокОкругленияПриИзменении(Элемент)
	//+МАН 11.03.25 Добавил проверку и условие. Заявка 3654
	Отбор = Новый Структура;
	Отбор.Вставить("Металл", ТекущийЭлемент.ТекущиеДанные.Металл);
	
	НайденныеСтроки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОкругление", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Заполнить порядок округления в нижней таблице выбранным значением?",  РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да, );
	КонецЕсли;
	//-МАН
КонецПроцедуры    

&НаКлиенте
Процедура ПослеОтветаНаВопросОкругление(Результат, Параметры) Экспорт  
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
		НовоеОкругление = ТекСтрока.ПорядокОкругления;
		КлючСтроки = ТекСтрока.КлючСтроки;
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", КлючСтроки);
		Строки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор); 
		
		Для каждого Стр Из строки Цикл 
			Стр.ПорядокОкругления = НовоеОкругление;
		Конеццикла;	
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура БазовыеНастройкиОкруглятьВБольшуюСторонуПриИзменении(Элемент)
	//+МАН 11.03.25 Добавил проверку и условие. Заявка 3654
	Отбор = Новый Структура;
	Отбор.Вставить("Металл", ТекущийЭлемент.ТекущиеДанные.Металл);
	
	НайденныеСтроки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОкруглениеВБольшуюСторону", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Заполнить метод округления в нижней таблице выбранным значением?",  РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да, );
	КонецЕсли;
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОкруглениеВБольшуюСторону(Результат, Параметры) Экспорт  
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
		НовоеОкруглениеВБольшуюСторону = ТекСтрока.ОкруглятьВБольшуюСторону;
		КлючСтроки = ТекСтрока.КлючСтроки;
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", КлючСтроки);
		Строки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор); 
		
		Для каждого Стр Из строки Цикл 
			Стр.ОкруглятьВБольшуюСторону = НовоеОкруглениеВБольшуюСторону;
		Конеццикла;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьЗначениеОтклоненияНастройки(Команда)
	ТекСтрокаН = Элементы.БазовыеНастройки.ТекущиеДанные; 
	Если ТекСтрокаН = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("Вид", 1);  
	Если НЕ Элементы.БазовыеНастройки.ТекущиеДанные = неопределено Тогда
	    ПараметрыФормы.Вставить("Металл", ТекСтрокаН.Металл);  
		ПараметрыФормы.Вставить("ВидОтклонения", ТекСтрокаН.ОтклонениеОтБазовойПоУмолчанию);
		ПараметрыФормы.Вставить("СписокП", ПолучитьСписокПроб(ТекСтрокаН.Металл));
		ПараметрыФормы.Вставить("СписокК", ПолучитьСписокКатегорий(ТекСтрокаН.Металл));
	КонецЕсли;   
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОтклоненияНастройки", ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_УстановитьШаблонПриказа.Форма.ФормаЗаполненияОтклонения", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтклоненияНастройки(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	ЗаполнитьТаблицуОтборовМ(Результат);
	
	ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
	Для каждого СтрМ Из ТаблицаОтборовМеталл Цикл
		
		Отбор = Новый Структура; 
		Отбор.Вставить("СхемаКредитования", Результат.СхемаКредитования);
		Отбор.Вставить("Металл", СтрМ.Металл);
		Отбор.Вставить("Проба", СтрМ.Проба);
	    Отбор.Вставить("КатегорияОбъектаЗалога", СтрМ.Категория);
	    Строки = Объект.НастройкаОтклоненийОтБазовыхЦен.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			НоваяСтр = Объект.НастройкаОтклоненийОтБазовыхЦен.Добавить();  
			НоваяСтр.КлючСтроки = ТекСтрока.КлючСтроки;
			НоваяСтр.СхемаКредитования = Результат.СхемаКредитования; 
			НоваяСтр.КатегорияОбъектаЗалога = СтрМ.Категория;  
			НоваяСтр.Металл = СтрМ.Металл;
			НоваяСтр.Проба = СтрМ.Проба;
			НоваяСтр.ЗначениеОтклонения = СтрМ.Отклонение;	
			НоваяСтр.ОтклонениеОтБазовойЦены = СтрМ.ВидОтклонения; 
	    Иначе
		   Для каждого Стр Из Строки Цикл	
			   Стр.ЗначениеОтклонения = СтрМ.Отклонение;	
			   Стр.ОтклонениеОтБазовойЦены = СтрМ.ВидОтклонения; 
		   КонецЦикла;	
	    КонецЕсли;  
	Конеццикла;  
	Объект.НастройкаОтклоненийОтБазовыхЦен.Сортировать("СхемаКредитования, Металл, Проба, КатегорияОбъектаЗалога"); 
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", ТекСтрока.КлючСтроки);	
	Элементы.НастройкаОтклоненийОтБазовыхЦен.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиОтклонений(Команда) 
	СтрокаТабличнойЧасти = Элементы.БазовыеНастройки.ТекущаяСтрока;
	Если НЕ СтрокаТабличнойЧасти = неопределено Тогда
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСК",ЭтаФорма);
	    ОткрытьФорму("Справочник.ЛБ_СхемыКредитования.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеВыбораСК(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	СтрокаТабличнойЧастиНастройки = Элементы.БазовыеНастройки.ТекущиеДанные;
	СК = Результат;  
	ЗаполнитьНастройкиОтклоненийНаСервере(СК, СтрокаТабличнойЧастиНастройки.ПолучитьИдентификатор());
	
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧастиНастройки.КлючСтроки);
	Элементы.НастройкаОтклоненийОтБазовыхЦен.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНастройкиОтклоненийНаСервере(СК, ИдентификаторСтроки) 
	СтрокаТабличнойЧастиНастройки = Объект.БазовыеНастройки.НайтиПоИдентификатору(ИдентификаторСтроки);
    ОтборК = Новый Структура;
	ОтборК.Вставить("КлючСтроки", СтрокаТабличнойЧастиНастройки.КлючСтроки);
	ОтборК.Вставить("СхемаКредитования", СК);
	СтрокиК = Объект.НастройкаОтклоненийОтБазовыхЦен.НайтиСтроки(ОтборК);
	Для каждого стрК из СтрокиК Цикл 
		Объект.НастройкаОтклоненийОтБазовыхЦен.Удалить(СтрК);
	КонецЦикла;	   
	
	СписокПроб = Новый СписокЗначений;
	СписокКатегорий = Новый СписокЗначений;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Металл", СтрокаТабличнойЧастиНастройки.Металл);
	СтрокиМ = Объект.Металлы.НайтиСтроки(Отбор);
	Для каждого СтрМ из СтрокиМ Цикл   
		ГруппаП = ЛБ_ОбщийМодуль.ПолучитьГруппуПроб(СтрМ.Проба);
		Если СписокПроб.НайтиПоЗначению(ГруппаП) = неопределено Тогда
			СписокПроб.Добавить(ГруппаП);
		КонецЕсли;	
		Если СписокКатегорий.НайтиПоЗначению(СтрМ.КатегорияОбъектаЗалога) = неопределено Тогда
			СписокКатегорий.Добавить(СтрМ.КатегорияОбъектаЗалога);
		КонецЕсли;	
	Конеццикла;	
	
	Для каждого Проба Из СписокПроб Цикл
		Для каждого Категория Из СписокКатегорий Цикл 
			 ЕстьЗаписьМеталлы = ложь;
			 ОтборМ = Новый Структура;
			 ОтборМ.Вставить("Металл", СтрокаТабличнойЧастиНастройки.Металл);
			 ОтборМ.Вставить("КатегорияОбъектаЗалога", Категория.Значение);  
			 Для каждого СтрП Из Проба.Значение.Пробы Цикл
				 ОтборМ.Вставить("Проба", СтрП.Проба); 
				 СтрокиМ = Объект.Металлы.НайтиСтроки(ОтборМ);
				 Если СтрокиМ.Количество() = 0 Тогда
					Продолжить; 
				 Иначе   
					ЕстьЗаписьМеталлы = Истина;
					Прервать;
				 КонецЕсли;	 
			 КонецЦикла;	
			 Если НЕ ЕстьЗаписьМеталлы Тогда
				Продолжить;
			 КонецЕсли;	

			 НоваяСтр = Объект.НастройкаОтклоненийОтБазовыхЦен.Добавить();
			 НоваяСтр.КлючСтроки = СтрокаТабличнойЧастиНастройки.КлючСтроки; 
			 НоваяСтр.СхемаКредитования = СК;
			 НоваяСтр.КатегорияОбъектаЗалога = Категория.Значение;
			 НоваяСтр.Металл = СтрокаТабличнойЧастиНастройки.Металл;
			 НоваяСтр.Проба = Проба.Значение; 
			 НоваяСтр.ОтклонениеОтБазовойЦены = СтрокаТабличнойЧастиНастройки.ОтклонениеОтБазовойПоУмолчанию;
		 Конеццикла;	 
	 КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьПоВидуВставки(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораВставки",ЭтаФорма);
	ПараметрыОтбора = новый Структура("НеОценивается", Ложь);
    ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
    ОткрытьФорму("Справочник.ЛБ_ДрагоценныеКамни.ФормаВыбора", ПараметрыФормы,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХранилищаВставки() 
	Возврат ПоместитьВоВременноеХранилище(Объект.Вставки.Выгрузить(), УникальныйИдентификатор);
КонецФункции	

&НаКлиенте
Процедура ПослеВыбораВставки(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Вставка", Результат); 
	ПараметрыФормы.Вставить("АдресХранилища", ПолучитьАдресХранилищаВставки());
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораХарактеристикВставки",ЭтаФорма);
    ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыбораХарактеристикВставки", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Процедура ПослеВыбораХарактеристикВставки(Результат, ДопПараметры) Экспорт
	 Если Результат = Неопределено Тогда
	    Возврат;
	КонецЕсли;  
	
	ТаблицаВ = ПолучитьИзВременногоХранилища(Результат.АдресХранилища);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Вставка", Результат.Вставка);
	Строки = Объект.Вставки.НайтиСтроки(Отбор); 
	Для каждого Стр Из Строки Цикл  
		Объект.Вставки.Удалить(стр);
	КонецЦикла;	
	
	Если НЕ ТаблицаВ.Количество() = 0 Тогда
		Запрос  = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", Результат.Вставка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ВесовыеГруппыДрагоценныхКамней.Ссылка КАК ВесоваяГруппа
		               |ИЗ
		               |	Справочник.ЛБ_ВесовыеГруппыДрагоценныхКамней КАК ЛБ_ВесовыеГруппыДрагоценныхКамней
		               |ГДЕ
		               |	ЛБ_ВесовыеГруппыДрагоценныхКамней.ВидДрагоценногоКамня = &Владелец
		               |	И ЛБ_ВесовыеГруппыДрагоценныхКамней.ПометкаУдаления = ЛОЖЬ";
		Выборка = Запрос.Выполнить().Выбрать(); 
		Если Выборка.Количество() = 0 Тогда 
			Для каждого стр Из ТаблицаВ Цикл
				НоваяСтр = Объект.Вставки.Добавить();
				НоваяСтр.Вставка = Результат.Вставка;
				НоваяСтр.ФормаОгранки = Стр.ФормаОгранки;
				НоваяСтр.ВидОгранки = Стр.ВидОгранки;
				НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
			КонецЦикла;	
		Иначе
			Пока Выборка.Следующий() Цикл
				Для каждого стр Из ТаблицаВ Цикл
					НоваяСтр = Объект.Вставки.Добавить();
					НоваяСтр.Вставка = Результат.Вставка;
					НоваяСтр.ФормаОгранки = Стр.ФормаОгранки;
					НоваяСтр.ВидОгранки = Стр.ВидОгранки;
					НоваяСтр.КачествоОгранки = Стр.КачествоОгранки;
					НоваяСтр.ВесоваяГруппа = Выборка.ВесоваяГруппа;
				КонецЦикла;	
			КонецЦикла;	 
		КонецЕсли;	
		Объект.Вставки.Сортировать("Вставка, ФормаОгранки, ВидОгранки, КачествоОгранки, ВесоваяГруппа");
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьВставки(Команда)
	Объект.Вставки.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПроцентныеСтавкиАкция(Команда)
	Объект.СтавкиПроцентовАкция.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПомощникЗаполненияПроцентныхСтавокАкция(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСтавокСК",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_СхемыКредитования.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХранилищаАкция() 
	Возврат ПоместитьВоВременноеХранилище(Объект.СтавкиПроцентовАкция.Выгрузить(), УникальныйИдентификатор);
КонецФункции

&НаСервере
Функция ПолучитьНеПрименятьАкции(СК) 
	Возврат СК.НеПрименятьАкции;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораСтавокСК(Результат, ДопПараметры) Экспорт
	 Если Результат = Неопределено Тогда
	    Возврат;
	КонецЕсли;   
	
	Если ПолучитьНеПрименятьАкции(Результат) Тогда  
		Предупреждение("Для выбранной схемы кредитования акции не применимы.", 60);
		Возврат;
	КонецЕсли;	
	
    Оповещение = Новый ОписаниеОповещения("ПослеВыбораСтавокАкция",ЭтаФорма);  
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКредитования", Результат);
	ПараметрыФормы.Вставить("Акция", Истина);
	ПараметрыФормы.Вставить("АдресХранилища", ПолучитьАдресХранилищаАкция());
	ОткрытьФорму("Обработка.ЛБ_ПомощникЗаполненияПроцентныхСтавок.Форма", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСтавокАкция(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	СК = Результат.СхемаКредитования; 
	Отбор = Новый структура;
	Отбор.Вставить("СхемаКредитования", СК);  
	Строки = Объект.СтавкиПроцентовАкция.НайтиСтроки(Отбор);
	Для каждого стр Из Строки Цикл
	    Объект.СтавкиПроцентовАкция.Удалить(Стр); 
	Конеццикла;	
	Для каждого Стр1 Из Результат.СтатусыКлиентов Цикл   
		Отбор = Новый Структура;
		Отбор.Вставить("Статус", Стр1.Статус); 
		Для каждого Стр2 Из Результат.ДниНачалаПрименения.НайтиСтроки(Отбор) Цикл 
			Для каждого Стр3 Из Результат.ДиапазоныСумм.НайтиСтроки(Отбор) Цикл 
				НоваяСтр = Объект.СтавкиПроцентовАкция.Добавить(); 
				НоваяСтр.СхемаКредитования = СК;
			    НоваяСтр.СтатусЗалогодателя = Стр1.Статус;
				НоваяСтр.ПричинаПрименения = Стр2.ПричинаПрименения; 
				НоваяСтр.ДиапазонСумм = Стр3.ДиапазонСумм;
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненийОчистить(Команда)
	Объект.НастройкаОтклоненийОтБазовыхЦен.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненийОтБазовыхЦенПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	СтрокаТабличнойЧасти = Элементы.БазовыеНастройки.ТекущиеДанные;
	ТекСтрока = Элементы.НастройкаОтклоненийОтБазовыхЦен.ТекущиеДанные;
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекСтрока.КлючСтроки = СтрокаТабличнойЧасти.КлючСтроки; 
		ТекСтрока.Металл = СтрокаТабличнойЧасти.Металл;  
		ТекСтрока.ОтклонениеОтБазовойЦены  = СтрокаТабличнойЧасти.ОтклонениеОтБазовойПоУмолчанию;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненийОтБазовыхЦенПробаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;    
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПробы",ЭтаФорма);
	СтрокаТабличнойЧасти = Элементы.БазовыеНастройки.ТекущиеДанные;
	ПараметрыОтбора = новый Структура("Металл", СтрокаТабличнойЧасти.Металл);
    ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
    ОткрытьФорму("Справочник.ЛБ_ГруппыПроб.ФормаВыбора", ПараметрыФормы,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораПробы(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекСтрока = Элементы.НастройкаОтклоненийОтБазовыхЦен.ТекущиеДанные;
		ТекСтрока.Проба = ВыбранноеЗначение;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненийОтБазовыхЦенКатегорияОбъектаЗалогаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКатегории",ЭтаФорма);
	ПараметрыОтбора = новый Структура("ПометкаУдаления", Ложь);
    ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
    ОткрытьФорму("Справочник.ЛБ_КатегорииОбъектовЗалога.ФормаВыбора", ПараметрыФормы,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораКатегории(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекСтрока = Элементы.НастройкаОтклоненийОтБазовыхЦен.ТекущиеДанные;
		ТекСтрока.КатегорияОбъектаЗалога = ВыбранноеЗначение;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СхемаКредитованияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТекущаяСК = Объект.СхемаКредитования;
КонецПроцедуры

&НаКлиенте
Процедура СхемаКредитованияПриИзменении(Элемент)
	Если НЕ ТекущаяСК = Объект.СхемаКредитования Тогда
		Объект.СтавкиПроцентов.Очистить();
		ТекущаяСК = Объект.СхемаКредитования;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда 
		Если НЕ НачалоДня(ТекущийОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Если НЕ ЭтоСуперпользователь Тогда 
				 Сообщить("Пользователь имеет право проводить документ только текущей датой. Измените дату документа.", статуссообщения.Важное);
			     Отказ = Истина;
				 Возврат;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненийОтБазовыхЦенПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", ТекСтрока.КлючСтроки);	
	Элементы.НастройкаОтклоненийОтБазовыхЦен.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаКлиенте
Процедура ВставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	ТекСтрока = Элементы.Вставки.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекСтрока.Вставка) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Вставка", ТекСтрока.Вставка); 
		ПараметрыФормы.Вставить("АдресХранилища", ПолучитьАдресХранилищаВставки());
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораХарактеристикВставки",ЭтаФорма);
	    ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыбораХарактеристикВставки", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьСостояниеДокумента();
	//+МАН 17.03.26 Изменение заголовка формы. Заявка 3654.
	УстановитьЗаголовокФормы();
	//-МАН
КонецПроцедуры

//+МАН 17.03.26 Изменение заголовка формы. Заявка 3654.
&НаСервере
Процедура УстановитьЗаголовокФормы()
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ЭтаФорма.Заголовок = "Установить шаблон приказа №" + Параметры.Ключ.НомерДокументаБезНулей + " от " + Параметры.Ключ.Дата;
	Иначе
		ЭтаФорма.Заголовок = "Установить шаблон приказа (создание)";
	КонецЕсли;
КонецПроцедуры
//-МАН
